# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

numbers = {0, 0, 1, 1, 2, 3, 4, 4, 4}
set(numbers)
print(numbers)